/*
SQLyog v10.2 
MySQL - 5.5.5-10.2.14-MariaDB-log : Database - ym_new
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`ym_new` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `ym_new`;

/*Table structure for table `frm_administrative_division` */

DROP TABLE IF EXISTS `frm_administrative_division`;

CREATE TABLE `frm_administrative_division` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `xzqhdm` varchar(20) DEFAULT NULL COMMENT '行政区划代码',
  `xzqhmz` varchar(80) DEFAULT NULL COMMENT '行政区划名字',
  `xxxzqhmz` varchar(80) DEFAULT NULL COMMENT '详细行政区划名字',
  `sjxzqhdm` varchar(20) DEFAULT NULL COMMENT '上级行政区划代码',
  `xzqhcj` varchar(10) DEFAULT NULL COMMENT '层级',
  `fzjg` varchar(10) DEFAULT NULL COMMENT '发证机关',
  `xzqhlb` varchar(20) DEFAULT NULL COMMENT '类别',
  `yzbm` varchar(20) DEFAULT NULL COMMENT '邮政编码',
  `cjsj` datetime DEFAULT NULL COMMENT '创建时间',
  `gxsj` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `xzqhdm` (`xzqhdm`)
) ENGINE=InnoDB AUTO_INCREMENT=202 DEFAULT CHARSET=utf8 COMMENT='行政区划表';

/*Data for the table `frm_administrative_division` */

insert  into `frm_administrative_division`(`id`,`xzqhdm`,`xzqhmz`,`xxxzqhmz`,`sjxzqhdm`,`xzqhcj`,`fzjg`,`xzqhlb`,`yzbm`,`cjsj`,`gxsj`) values (1,'008600000000','中国','中华人民共和国','0','1','','国家','008600','2019-11-09 21:40:00','2019-11-09 21:40:01'),(2,'450100000000','广西省','广西壮族自治区','008600000000','2','桂','省','530000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(3,'450700000000','钦州市','广西壮族自治区钦州市','450100000000','3','桂N','地级市','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(4,'450701000000','钦州市市辖区','广西壮族自治区钦州市市辖区','450700000000','4','桂N','市区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(5,'450702000000','钦州市钦南区','广西壮族自治区钦州市钦南区','450700000000','4','桂N','市区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(6,'450703000000','钦州市钦北区','广西壮族自治区钦州市钦北区','450700000000','4','桂N','市区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(7,'450704000000','钦州市灵山县','广西壮族自治区钦州市灵山县','450700000000','4','桂N','县','535400','2019-11-09 21:40:00','2019-11-09 21:40:01'),(8,'450721000000','钦州市浦北县','广西壮族自治区钦州市浦北县','450700000000','4','桂N','县','535300','2019-11-09 21:40:00','2019-11-09 21:40:01'),(9,'450722000000','钦州市浦北县','广西壮族自治区钦州市浦北县','450700000000','4','桂N','县','535300','2019-11-09 21:40:00','2019-11-09 21:40:01'),(10,'450702001000','向阳街道','广西壮族自治区钦州市钦南区向阳街道','450702000000','5','桂N','街道','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(11,'450702002000','水东街道','广西壮族自治区钦州市钦南区水东街道','450702000000','5','桂N','街道','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(12,'450702003000','文峰街道','广西壮族自治区钦州市钦南区文峰街道','450702000000','5','桂N','街道','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(13,'450702004000','南珠街道','广西壮族自治区钦州市钦南区南珠街道','450702000000','5','桂N','街道','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(14,'450702005000','尖山街道','广西壮族自治区钦州市钦南区尖山街道','450702000000','5','桂N','街道','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(15,'450702100000','沙埠镇','广西壮族自治区钦州市钦南区沙埠镇','450702000000','5','桂N','镇','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(16,'450702101000','康熙岭镇','广西壮族自治区钦州市钦南区康熙岭镇','450702000000','5','桂N','镇','535012','2019-11-09 21:40:00','2019-11-09 21:40:01'),(17,'450702102000','黄屋屯镇','广西壮族自治区钦州市钦南区黄屋屯镇','450702000000','5','桂N','镇','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(18,'450702104000','大番坡镇','广西壮族自治区钦州市钦南区大番坡镇','450702000000','5','桂N','镇','535037','2019-11-09 21:40:00','2019-11-09 21:40:01'),(19,'450702105000','龙门港镇','广西壮族自治区钦州市钦南区龙门港镇','450702000000','5','桂N','镇','535034','2019-11-09 21:40:00','2019-11-09 21:40:01'),(20,'450702107000','久隆镇','广西壮族自治区钦州市钦南区久隆镇','450702000000','5','桂N','镇','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(21,'450702108000','东场镇','广西壮族自治区钦州市钦南区东场镇','450702000000','5','桂N','镇','535014','2019-11-09 21:40:00','2019-11-09 21:40:01'),(22,'450702109000','那丽镇','广西壮族自治区钦州市钦南区那丽镇','450702000000','5','桂N','镇','535013','2019-11-09 21:40:00','2019-11-09 21:40:01'),(23,'450702110000','那彭镇','广西壮族自治区钦州市钦南区那彭镇','450702000000','5','桂N','镇','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(24,'450702111000','那思镇','广西壮族自治区钦州市钦南区那思镇','450702000000','5','桂N','镇','535016','2019-11-09 21:40:00','2019-11-09 21:40:01'),(25,'450702112000','犀牛脚镇','广西壮族自治区钦州市钦南区犀牛脚镇','450702000000','5','桂N','镇','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(26,'450702400000','丽光华侨农场','广西壮族自治区钦州市钦南区丽光华侨农场','450702000000','5','桂N','农场','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(27,'450702401000','钦州港经济技术开发区','广西壮族自治区钦州市钦南区钦州港经济技术开发区','450702000000','5','桂N','开发区','535008','2019-11-09 21:40:00','2019-11-09 21:40:01'),(28,'450702402000','三娘湾旅游管理区','广西壮族自治区钦州市钦南区三娘湾旅游管理区','450702000000','5','桂N','管理区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(29,'450702403000','广西钦州保税港区','广西壮族自治区钦州市钦南区广西钦州保税港区','450702000000','5','桂N','港区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(30,'450702404000','中马钦州产业园区','广西壮族自治区钦州市钦南区中马钦州产业园区','450702000000','5','桂N','园区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(31,'450702001003','新兴社区居委会','广西壮族自治区钦州市钦南区向阳街道办事处新兴社区','450702001000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(32,'450702001004','新兴社区居委会','广西壮族自治区钦州市钦南区向阳街道办事处新兴社区','450702001000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(33,'450702002001','东南社区居委会','广西壮族自治区钦州市钦南区水东街道办事处东南社区','450702002000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(34,'450702002002','五里桥社区居委会','广西壮族自治区钦州市钦南区水东街道办事处五里桥社区','450702002000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(35,'450702002005','大沙垌社区居委会','广西壮族自治区钦州市钦南区水东街道办事处大沙垌社区','450702002000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(36,'450702003001','东风社区居委会','广西壮族自治区钦州市钦南区文峰街道办事处东风社区','450702003000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(37,'450702003002','江滨社区居委会','广西壮族自治区钦州市钦南区文峰街道办事处江滨社区','450702003000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(38,'450702003003','中山社区居委会','广西壮族自治区钦州市钦南区文峰街道办事处中山社区','450702003000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(39,'450702003004','三宣堂社区居委会','广西壮族自治区钦州市钦南区文峰街道办事处三宣堂社区','450702003000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(40,'450702003005','文昌社区居委会','广西壮族自治区钦州市钦南区文峰街道办事处文昌社区','450702003000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(41,'450702003006','新隆社区居委会','广西壮族自治区钦州市钦南区文峰街道办事处新隆社区','450702003000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(42,'450702004001','城西社区居委会','广西壮族自治区钦州市钦南区南珠街道办事处城西社区','450702004000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(43,'450702004002','高岭社区居委会','广西壮族自治区钦州市钦南区南珠街道办事处高岭社区','450702004000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(44,'450702004003','鸿泰社区居委会','广西壮族自治区钦州市钦南区南珠街道办事处鸿泰社区','450702004000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(45,'450702005001','尖山社区居委会','广西壮族自治区钦州市钦南区尖山街道办事处尖山社区','450702005000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(46,'450702005002','排榜社区居委会','广西壮族自治区钦州市钦南区尖山街道办事处排榜社区','450702005000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(47,'450702005202','西沟村委会','广西壮族自治区钦州市钦南区尖山街道办事处西沟村','450702005000','6','桂N','村','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(48,'450702005203','黄坡豕村委会','广西壮族自治区钦州市钦南区尖山街道办事处黄坡豕村','450702005000','6','桂N','村','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(49,'450702005204','谷仓村委会','广西壮族自治区钦州市钦南区尖山街道办事处谷仓村','450702005000','6','桂N','村','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(50,'450702005205','九鸦村委会','广西壮族自治区钦州市钦南区尖山街道办事处九鸦村','450702005000','6','桂N','村','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(51,'450702005206','黎头咀村委会','广西壮族自治区钦州市钦南区尖山街道办事处黎头咀村','450702005000','6','桂N','村','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(52,'450702100001','沙埠社区','广西壮族自治区钦州市钦南区沙埠镇沙埠社区','450702100000','6','桂N','社区','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(53,'450702100002','田寮社区','广西壮族自治区钦州市钦南区沙埠镇田寮社区','450702100000','6','桂N','社区','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(54,'450702100201','大石古村','广西壮族自治区钦州市钦南区沙埠镇大石古村','450702100000','6','桂N','村','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(55,'450702100202','下南山村','广西壮族自治区钦州市钦南区沙埠镇下南山村','450702100000','6','桂N','村','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(56,'450702100203','大岭村','广西壮族自治区钦州市钦南区沙埠镇大岭村','450702100000','6','桂N','村','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(57,'450702100204','沙寮村','广西壮族自治区钦州市钦南区沙埠镇沙寮村','450702100000','6','桂N','村','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(58,'450702100205','油路村','广西壮族自治区钦州市钦南区沙埠镇油路村','450702100000','6','桂N','村','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(59,'450702100206','桥坪村','广西壮族自治区钦州市钦南区沙埠镇桥坪村','450702100000','6','桂N','村','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(60,'450702100207','海棠村','广西壮族自治区钦州市钦南区沙埠镇海棠村','450702100000','6','桂N','村','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(61,'450702100210','分界村','广西壮族自治区钦州市钦南区沙埠镇分界村','450702100000','6','桂N','村','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(62,'450702100211','坭桥村','广西壮族自治区钦州市钦南区沙埠镇坭桥村','450702100000','6','桂N','村','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(63,'450702100212','望埠村','广西壮族自治区钦州市钦南区沙埠镇望埠村','450702100000','6','桂N','村','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(64,'450702100213','平艮村','广西壮族自治区钦州市钦南区沙埠镇平艮村','450702100000','6','桂N','村','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(65,'450702100214','油埠村','广西壮族自治区钦州市钦南区沙埠镇油埠村','450702100000','6','桂N','村','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(66,'450702100215','明天移民新村','广西壮族自治区钦州市钦南区沙埠镇明天移民新村','450702100000','6','桂N','村','535011','2019-11-09 21:40:00','2019-11-09 21:40:01'),(67,'450702101201','傍钦村','广西壮族自治区钦州市钦南区康熙岭镇傍钦村','450702101000','6','桂N','村','535012','2019-11-09 21:40:00','2019-11-09 21:40:01'),(68,'450702101202','高沙村','广西壮族自治区钦州市钦南区康熙岭镇高沙村','450702101000','6','桂N','村','535012','2019-11-09 21:40:00','2019-11-09 21:40:01'),(69,'450702101203','西围村','广西壮族自治区钦州市钦南区康熙岭镇西围村','450702101000','6','桂N','村','535012','2019-11-09 21:40:00','2019-11-09 21:40:01'),(70,'450702101204','新平村','广西壮族自治区钦州市钦南区康熙岭镇新平村','450702101000','6','桂N','村','535012','2019-11-09 21:40:00','2019-11-09 21:40:01'),(71,'450702101205','诗家村','广西壮族自治区钦州市钦南区康熙岭镇诗家村','450702101000','6','桂N','村','535012','2019-11-09 21:40:00','2019-11-09 21:40:01'),(72,'450702101206','白鸡村','广西壮族自治区钦州市钦南区康熙岭镇白鸡村','450702101000','6','桂N','村','535012','2019-11-09 21:40:00','2019-11-09 21:40:01'),(73,'450702101207','板坪村','广西壮族自治区钦州市钦南区康熙岭镇板坪村','450702101000','6','桂N','村','535012','2019-11-09 21:40:00','2019-11-09 21:40:01'),(74,'450702101208','横山村','广西壮族自治区钦州市钦南区康熙岭镇横山村','450702101000','6','桂N','村','535012','2019-11-09 21:40:00','2019-11-09 21:40:01'),(75,'450702101209','长坡村','广西壮族自治区钦州市钦南区康熙岭镇长坡村','450702101000','6','桂N','村','535012','2019-11-09 21:40:00','2019-11-09 21:40:01'),(76,'450702101210','团和村','广西壮族自治区钦州市钦南区康熙岭镇团和村','450702101000','6','桂N','村','535012','2019-11-09 21:40:00','2019-11-09 21:40:01'),(77,'450702101211','新营村','广西壮族自治区钦州市钦南区康熙岭镇新营村','450702101000','6','桂N','村','535012','2019-11-09 21:40:00','2019-11-09 21:40:01'),(78,'450702101212','新南村','广西壮族自治区钦州市钦南区康熙岭镇新南村','450702101000','6','桂N','村','535012','2019-11-09 21:40:00','2019-11-09 21:40:01'),(79,'450702102001','黄屋屯社区','广西壮族自治区钦州市钦南区黄屋屯镇黄屋屯社区','450702102000','6','桂N','社区','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(80,'450702102201','屯西村','广西壮族自治区钦州市钦南区黄屋屯镇屯西村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(81,'450702102202','屯安村','广西壮族自治区钦州市钦南区黄屋屯镇屯安村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(82,'450702102203','屯胜村','广西壮族自治区钦州市钦南区黄屋屯镇屯胜村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(83,'450702102204','屯利村','广西壮族自治区钦州市钦南区黄屋屯镇屯利村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(84,'450702102205','加其村','广西壮族自治区钦州市钦南区黄屋屯镇加其村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(85,'450702102206','屯北村','广西壮族自治区钦州市钦南区黄屋屯镇屯北村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(86,'450702102207','大冲村','广西壮族自治区钦州市钦南区黄屋屯镇大冲村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(87,'450702102208','屯光村','广西壮族自治区钦州市钦南区黄屋屯镇屯光村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(88,'450702102209','屯南村','广西壮族自治区钦州市钦南区黄屋屯镇屯南村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(89,'450702102210','金竹村','广西壮族自治区钦州市钦南区黄屋屯镇金竹村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(90,'450702102211','圩埠村','广西壮族自治区钦州市钦南区黄屋屯镇圩埠村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(91,'450702102212','田寮村','广西壮族自治区钦州市钦南区黄屋屯镇田寮村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(92,'450702102213','塘营村','广西壮族自治区钦州市钦南区黄屋屯镇塘营村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(93,'450702102214','屯显村','广西壮族自治区钦州市钦南区黄屋屯镇屯显村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(94,'450702102215','西显村','广西壮族自治区钦州市钦南区黄屋屯镇西显村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(95,'450702102216','料连村','广西壮族自治区钦州市钦南区黄屋屯镇料连村','450702102000','6','桂N','村','535033','2019-11-09 21:40:00','2019-11-09 21:40:01'),(96,'450702104001','茅坡社区','广西壮族自治区钦州市钦南区大番坡镇茅坡社区','450702000000','6','桂N','社区','535037','2019-11-09 21:40:00','2019-11-09 21:40:01'),(97,'450702104201','沙坡村','广西壮族自治区钦州市钦南区大番坡镇沙坡村','450702000000','6','桂N','村','535037','2019-11-09 21:40:00','2019-11-09 21:40:01'),(98,'450702104202','葵子村','广西壮族自治区钦州市钦南区大番坡镇葵子村','450702000000','6','桂N','村','535037','2019-11-09 21:40:00','2019-11-09 21:40:01'),(99,'450702104203','大番坡村','广西壮族自治区钦州市钦南区大番坡镇大番坡村','450702000000','6','桂N','村','535037','2019-11-09 21:40:00','2019-11-09 21:40:01'),(100,'450702104204','青龙村','广西壮族自治区钦州市钦南区大番坡镇青龙村','450702000000','6','桂N','村','535037','2019-11-09 21:40:00','2019-11-09 21:40:01'),(101,'450702104205','板桥村','广西壮族自治区钦州市钦南区大番坡镇板桥村','450702000000','6','桂N','村','535037','2019-11-09 21:40:00','2019-11-09 21:40:01'),(102,'450702104206','大窝口村','广西壮族自治区钦州市钦南区大番坡镇大窝口村','450702000000','6','桂N','村','535037','2019-11-09 21:40:00','2019-11-09 21:40:01'),(103,'450702104207','六村村','广西壮族自治区钦州市钦南区大番坡镇六村村','450702000000','6','桂N','村','535037','2019-11-09 21:40:00','2019-11-09 21:40:01'),(104,'450702104208','深坪村','广西壮族自治区钦州市钦南区大番坡镇深坪村','450702000000','6','桂N','村','535037','2019-11-09 21:40:00','2019-11-09 21:40:01'),(105,'450702104210','辣椒槌村','广西壮族自治区钦州市钦南区大番坡镇辣椒槌村','450702000000','6','桂N','村','535037','2019-11-09 21:40:00','2019-11-09 21:40:01'),(106,'450702105201','东村','广西壮族自治区钦州市钦南区龙门港镇东村','450702105000','6','桂N','村','535034','2019-11-09 21:40:00','2019-11-09 21:40:01'),(107,'450702105202','南村','广西壮族自治区钦州市钦南区龙门港镇南村','450702105000','6','桂N','村','535034','2019-11-09 21:40:00','2019-11-09 21:40:01'),(108,'450702105203','西村','广西壮族自治区钦州市钦南区龙门港镇西村','450702105000','6','桂N','村','535034','2019-11-09 21:40:00','2019-11-09 21:40:01'),(109,'450702105204','北村','广西壮族自治区钦州市钦南区龙门港镇北村','450702105000','6','桂N','村','535034','2019-11-09 21:40:00','2019-11-09 21:40:01'),(110,'450702107001','久隆社区','广西壮族自治区钦州市钦南区久隆镇久隆社区',' 450702107000','6','桂N','社区','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(111,'450702107201','久隆村','广西壮族自治区钦州市钦南区久隆镇久隆村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(112,'450702107202','黎屋村','广西壮族自治区钦州市钦南区久隆镇黎屋村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(113,'450702107203','沙田村','广西壮族自治区钦州市钦南区久隆镇沙田村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(114,'450702107204','丁屋村','广西壮族自治区钦州市钦南区久隆镇丁屋村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(115,'450702107205','高桥村','广西壮族自治区钦州市钦南区久隆镇高桥村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(116,'450702107206','水铺村','广西壮族自治区钦州市钦南区久隆镇水铺村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(117,'450702107207','新明村','广西壮族自治区钦州市钦南区久隆镇新明村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(118,'450702107208','平新村','广西壮族自治区钦州市钦南区久隆镇平新村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(119,'450702107209','那庆村','广西壮族自治区钦州市钦南区久隆镇那庆村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(120,'450702107210','白鹤村','广西壮族自治区钦州市钦南区久隆镇白鹤村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(121,'450702107211','青草村','广西壮族自治区钦州市钦南区久隆镇青草村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(122,'450702107212','大岭村','广西壮族自治区钦州市钦南区久隆镇大岭村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(123,'450702107213','高明村','广西壮族自治区钦州市钦南区久隆镇高明村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(124,'450702107214','新圩村','广西壮族自治区钦州市钦南区久隆镇新圩村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(125,'450702107215','石安村','广西壮族自治区钦州市钦南区久隆镇石安村','450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(126,'450702107216','细岭头村','广西壮族自治区钦州市钦南区久隆镇细岭头村',' 450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(127,'450702107217','荷木村','广西壮族自治区钦州市钦南区久隆镇荷木村',' 450702107000','6','桂N','村','535017','2019-11-09 21:40:00','2019-11-09 21:40:01'),(128,'450702108201','关塘村','广西壮族自治区钦州市钦南区东场镇关塘村','450702108000','6','桂N','村','535014','2019-11-09 21:40:00','2019-11-09 21:40:01'),(129,'450702108202','六加村','广西壮族自治区钦州市钦南区东场镇六加村','450702108000','6','桂N','村','535014','2019-11-09 21:40:00','2019-11-09 21:40:01'),(130,'450702108203','高塘村','广西壮族自治区钦州市钦南区东场镇高塘村','450702108000','6','桂N','村','535014','2019-11-09 21:40:00','2019-11-09 21:40:01'),(131,'450702108204','东场村','广西壮族自治区钦州市钦南区东场镇东场村','450702108000','6','桂N','村','535014','2019-11-09 21:40:00','2019-11-09 21:40:01'),(132,'450702108205','英窝村','广西壮族自治区钦州市钦南区东场镇英窝村','450702108000','6','桂N','村','535014','2019-11-09 21:40:00','2019-11-09 21:40:01'),(133,'450702108206','白木村','广西壮族自治区钦州市钦南区东场镇白木村','450702108000','6','桂N','村','535014','2019-11-09 21:40:00','2019-11-09 21:40:01'),(134,'450702108207','上寮村','广西壮族自治区钦州市钦南区东场镇上寮村','450702108000','6','桂N','村','535014','2019-11-09 21:40:00','2019-11-09 21:40:01'),(135,'450702109001','那丽社区','广西壮族自治区钦州市钦南区那丽镇那丽社区','450702109000','6','桂N','社区','535013','2019-11-09 21:40:00','2019-11-09 21:40:01'),(136,'450702109201','那丽村','广西壮族自治区钦州市钦南区那丽镇那丽村','450702109000','6','桂N','村','535013','2019-11-09 21:40:00','2019-11-09 21:40:01'),(137,'450702109202','充包村','广西壮族自治区钦州市钦南区那丽镇充包村','450702109000','6','桂N','村','535013','2019-11-09 21:40:00','2019-11-09 21:40:01'),(138,'450702109203','殿艮村','广西壮族自治区钦州市钦南区那丽镇殿艮村','450702109000','6','桂N','村','535013','2019-11-09 21:40:00','2019-11-09 21:40:01'),(139,'450702109204','芦荻竹村','广西壮族自治区钦州市钦南区那丽镇芦荻竹村','450702109000','6','桂N','村','535013','2019-11-09 21:40:00','2019-11-09 21:40:01'),(140,'450702109205','嫦娥垌村','广西壮族自治区钦州市钦南区那丽镇嫦娥垌村','450702109000','6','桂N','村','535013','2019-11-09 21:40:00','2019-11-09 21:40:01'),(141,'450702109206','马鞍岭村','广西壮族自治区钦州市钦南区那丽镇马鞍岭村','450702109000','6','桂N','村','535013','2019-11-09 21:40:00','2019-11-09 21:40:01'),(142,'450702109207','崩塘村','广西壮族自治区钦州市钦南区那丽镇崩塘村','450702109000','6','桂N','村','535013','2019-11-09 21:40:00','2019-11-09 21:40:01'),(143,'450702109208','那雾塘村','广西壮族自治区钦州市钦南区那丽镇那雾塘村','450702109000','6','桂N','村','535013','2019-11-09 21:40:00','2019-11-09 21:40:01'),(144,'450702109209','土地田村','广西壮族自治区钦州市钦南区那丽镇土地田村','450702109000','6','桂N','村','535013','2019-11-09 21:40:00','2019-11-09 21:40:01'),(145,'450702109210','三蔸竹村','广西壮族自治区钦州市钦南区那丽镇三蔸竹村','450702109000','6','桂N','村','535013','2019-11-09 21:40:00','2019-11-09 21:40:01'),(146,'450702110001','那彭社区','广西壮族自治区钦州市钦南区那彭镇那彭社区','450702110000','6','桂N','社区','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(147,'450702110201','那彭村','广西壮族自治区钦州市钦南区那彭镇那彭村','450702110000','6','桂N','村','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(148,'450702110202','担坳村','广西壮族自治区钦州市钦南区那彭镇担坳村','450702110000','6','桂N','村','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(149,'450702110203','那蒟村','广西壮族自治区钦州市钦南区那彭镇那蒟村','450702110000','6','桂N','村','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(150,'450702110204','白沙村','广西壮族自治区钦州市钦南区那彭镇白沙村','450702110000','6','桂N','村','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(151,'450702110205','六湖村','广西壮族自治区钦州市钦南区那彭镇六湖村','450702110000','6','桂N','村','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(152,'450702110206','彭新村','广西壮族自治区钦州市钦南区那彭镇彭新村','450702110000','6','桂N','村','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(153,'450702110207','清湖村','广西壮族自治区钦州市钦南区那彭镇清湖村','450702110000','6','桂N','村','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(154,'450702110208','那勉村','广西壮族自治区钦州市钦南区那彭镇那勉村','450702110000','6','桂N','村','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(155,'450702110209','凤凰岗村','广西壮族自治区钦州市钦南区那彭镇凤凰岗村','450702110000','6','桂N','村','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(156,'450702110210','那里村','广西壮族自治区钦州市钦南区那彭镇那里村','450702110000','6','桂N','村','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(157,'450702110211','后立村','广西壮族自治区钦州市钦南区那彭镇后立村','450702110000','6','桂N','村','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(158,'450702110212','英学村','广西壮族自治区钦州市钦南区那彭镇英学村','450702110000','6','桂N','村','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(159,'450702110213','屋背村','广西壮族自治区钦州市钦南区那彭镇屋背村','450702110000','6','桂N','村','535015','2019-11-09 21:40:00','2019-11-09 21:40:01'),(160,'450702111201','合江村','广西壮族自治区钦州市钦南区那思镇合江村','450702111000','6','桂N','村','535016','2019-11-09 21:40:00','2019-11-09 21:40:01'),(161,'450702111202','禄宦塘村','广西壮族自治区钦州市钦南区那思镇禄宦塘村','450702111000','6','桂N','村','535016','2019-11-09 21:40:00','2019-11-09 21:40:01'),(162,'450702111203','米子村','广西壮族自治区钦州市钦南区那思镇米子村','450702111000','6','桂N','村','535016','2019-11-09 21:40:00','2019-11-09 21:40:01'),(163,'450702111204','那京村','广西壮族自治区钦州市钦南区那思镇那京村','450702111000','6','桂N','村','535016','2019-11-09 21:40:00','2019-11-09 21:40:01'),(164,'450702111205','那思村','广西壮族自治区钦州市钦南区那思镇那思村','450702111000','6','桂N','村','535016','2019-11-09 21:40:00','2019-11-09 21:40:01'),(165,'450702111206','塘底村','广西壮族自治区钦州市钦南区那思镇塘底村','450702111000','6','桂N','村','535016','2019-11-09 21:40:00','2019-11-09 21:40:01'),(166,'450702111207','定蒙村','广西壮族自治区钦州市钦南区那思镇定蒙村','450702111000','6','桂N','村','535016','2019-11-09 21:40:00','2019-11-09 21:40:01'),(167,'450702111208','茶蓝垌村','广西壮族自治区钦州市钦南区那思镇茶蓝垌村','450702111000','6','桂N','村','535016','2019-11-09 21:40:00','2019-11-09 21:40:01'),(168,'450702111209','牛寮水村','广西壮族自治区钦州市钦南区那思镇牛寮水村','450702111000','6','桂N','村','535016','2019-11-09 21:40:00','2019-11-09 21:40:01'),(169,'450702111210','扁陂村','广西壮族自治区钦州市钦南区那思镇扁陂村','450702111000','6','桂N','村','535016','2019-11-09 21:40:00','2019-11-09 21:40:01'),(170,'450702112001','新联社区','广西壮族自治区钦州市钦南区犀牛脚镇新联社区','450702112000','6','桂N','社区','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(171,'450702112002','丹寮社区','广西壮族自治区钦州市钦南区犀牛脚镇丹寮社区','450702112000','6','桂N','社区','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(172,'450702112203','犀牛脚村','广西壮族自治区钦州市钦南区犀牛脚镇犀牛脚村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(173,'450702112205','联民村','广西壮族自治区钦州市钦南区犀牛脚镇联民村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(174,'450702112206','白路村','广西壮族自治区钦州市钦南区犀牛脚镇白路村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(175,'450702112207','船厂村','广西壮族自治区钦州市钦南区犀牛脚镇船厂村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(176,'450702112208','岭脚村','广西壮族自治区钦州市钦南区犀牛脚镇岭脚村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(177,'450702112209','西寮村','广西壮族自治区钦州市钦南区犀牛脚镇西寮村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(178,'450702112210','炮台村','广西壮族自治区钦州市钦南区犀牛脚镇炮台村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(179,'450702112211','岭门村','广西壮族自治区钦州市钦南区犀牛脚镇岭门村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(180,'450702112212','埠头村','广西壮族自治区钦州市钦南区犀牛脚镇埠头村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(181,'450702112213','西坑村','广西壮族自治区钦州市钦南区犀牛脚镇西坑村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(182,'450702112214','大灶村','广西壮族自治区钦州市钦南区犀牛脚镇大灶村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(183,'450702112215','平山村','广西壮族自治区钦州市钦南区犀牛脚镇平山村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(184,'450702112217','大坪村','广西壮族自治区钦州市钦南区犀牛脚镇大坪村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(185,'450702112219','沙角村','广西壮族自治区钦州市钦南区犀牛脚镇沙角村','450702112000','6','桂N','村','535035','2019-11-09 21:40:00','2019-11-09 21:40:01'),(186,'450702400501','总场','广西壮族自治区钦州市钦南区丽光华侨农场总场','450702400000','6','桂N','农场','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(187,'450702400502','新屋管区生活区','广西壮族自治区钦州市钦南区丽光华侨农场新屋管区生活区','450702400000','6','桂N','生活区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(188,'450702400503','均田管区生活区','广西壮族自治区钦州市钦南区丽光华侨农场均田管区生活区','450702400000','6','桂N','生活区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(189,'450702400504','凤凰管区生活区','广西壮族自治区钦州市钦南区丽光华侨农场凤凰管区生活区','450702400000','6','桂N','生活区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(190,'450702401001','滨海社区','广西壮族自治区钦州市钦南区钦州港经济技术开发区滨海社区','450702401000','6','桂N','社区','535008','2019-11-09 21:40:00','2019-11-09 21:40:01'),(191,'450702401002','亚路江社区','广西壮族自治区钦州市钦南区钦州港经济技术开发区亚路江社区','450702401000','6','桂N','社区','535008','2019-11-09 21:40:00','2019-11-09 21:40:01'),(192,'450702401003','水井坑社区','广西壮族自治区钦州市钦南区钦州港经济技术开发区水井坑社区','450702401000','6','桂N','社区','535008','2019-11-09 21:40:00','2019-11-09 21:40:01'),(193,'450702401004','果子山社区','广西壮族自治区钦州市钦南区钦州港经济技术开发区果子山社区','450702401000','6','桂N','社区','535008','2019-11-09 21:40:00','2019-11-09 21:40:01'),(194,'450702401005','鸡墩头社区','广西壮族自治区钦州市钦南区钦州港经济技术开发区鸡墩头社区','450702401000','6','桂N','社区','535008','2019-11-09 21:40:00','2019-11-09 21:40:01'),(195,'450702401006','金鼓社区','广西壮族自治区钦州市钦南区钦州港经济技术开发区金鼓社区','450702401000','6','桂N','社区','535008','2019-11-09 21:40:00','2019-11-09 21:40:01'),(196,'450702401007','鹿耳环社区','广西壮族自治区钦州市钦南区钦州港经济技术开发区鹿耳环社区','450702401000','6','桂N','社区','535008','2019-11-09 21:40:00','2019-11-09 21:40:01'),(197,'450702402201','三娘湾村','广西壮族自治区钦州市钦南区三娘湾旅游管理区三娘湾村','450702402000','6','桂N','村','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(198,'450702402202','大环村','广西壮族自治区钦州市钦南区三娘湾旅游管理区大环村','450702402000','6','桂N','村','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(199,'450702402204','乌雷村','广西壮族自治区钦州市钦南区三娘湾旅游管理区乌雷村','450702402000','6','桂N','村','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(200,'450702403498','虚拟社区','广西壮族自治区钦州市钦南区广西钦州保税港区虚拟社区','450702403000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01'),(201,'450702404498','虚拟社区','广西壮族自治区钦州市钦南区中马钦州产业园区虚拟社区','450702404000','6','桂N','社区','535000','2019-11-09 21:40:00','2019-11-09 21:40:01');

/*Table structure for table `sys_menu` */

DROP TABLE IF EXISTS `sys_menu`;

CREATE TABLE `sys_menu` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT '菜单id',
  `pid` int(11) unsigned NOT NULL DEFAULT 0 COMMENT '上级菜单，0为顶级菜单',
  `mc` varchar(32) NOT NULL DEFAULT '' COMMENT '菜单名称',
  `url` varchar(100) NOT NULL DEFAULT '' COMMENT '图标url',
  `px` int(11) unsigned NOT NULL DEFAULT 100 COMMENT '排序,小靠前',
  `zt` tinyint(3) unsigned NOT NULL DEFAULT 1 COMMENT '菜单状态：0代表删除，1代表正常，2代表停用',
  `cjsj` datetime DEFAULT NULL COMMENT '创建时间',
  `gxsj` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8 COMMENT='菜单表';

/*Data for the table `sys_menu` */

insert  into `sys_menu`(`id`,`pid`,`mc`,`url`,`px`,`zt`,`cjsj`,`gxsj`) values (12,0,'测试菜单1','/fun1/fun_a',100,1,NULL,NULL);

/*Table structure for table `sys_role` */

DROP TABLE IF EXISTS `sys_role`;

CREATE TABLE `sys_role` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `mc` varchar(32) NOT NULL DEFAULT '' COMMENT '角色名称',
  `sm` varchar(20) NOT NULL DEFAULT '' COMMENT '角色说明',
  `bz` varchar(300) NOT NULL DEFAULT '' COMMENT '备注',
  `zt` tinyint(4) DEFAULT 1 COMMENT '角色状态：0代表删除，1代表正常，2代表停用',
  `cjsj` datetime DEFAULT NULL COMMENT '创建时间',
  `gxsj` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='角色表';

/*Data for the table `sys_role` */

insert  into `sys_role`(`id`,`mc`,`sm`,`bz`,`zt`,`cjsj`,`gxsj`) values (2,'ROLE_admin','超级管理员','超级管理员拥有所有权限',1,NULL,NULL),(3,'ROLE_manager','业务管理员','操作业务的',1,NULL,NULL),(4,'visitor','访问者','只能浏览',1,NULL,NULL);

/*Table structure for table `sys_role_menu` */

DROP TABLE IF EXISTS `sys_role_menu`;

CREATE TABLE `sys_role_menu` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `roleid` int(10) unsigned NOT NULL DEFAULT 0 COMMENT '角色id',
  `menuid` int(10) unsigned NOT NULL DEFAULT 0 COMMENT '菜单id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='角色-菜单-权限关联表';

/*Data for the table `sys_role_menu` */

insert  into `sys_role_menu`(`id`,`roleid`,`menuid`) values (2,2,12);

/*Table structure for table `sys_user` */

DROP TABLE IF EXISTS `sys_user`;

CREATE TABLE `sys_user` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `username` varchar(32) NOT NULL DEFAULT '' COMMENT '用户名',
  `password` varchar(100) NOT NULL DEFAULT '' COMMENT '密码',
  `nc` varchar(32) NOT NULL DEFAULT '' COMMENT '昵称',
  `xb` tinyint(3) unsigned NOT NULL DEFAULT 1 COMMENT '性别',
  `dh` varchar(30) NOT NULL DEFAULT '' COMMENT '电话',
  `dzyx` varchar(50) NOT NULL DEFAULT '' COMMENT '电子邮箱',
  `zhyxq` datetime DEFAULT NULL COMMENT '账户有效期',
  `mmyxq` datetime DEFAULT NULL COMMENT '密码有效期',
  `zt` tinyint(3) unsigned NOT NULL DEFAULT 1 COMMENT '用户状态：0代表删除，1代表正常，2代表锁定（停用）',
  `zjdlip` varchar(20) NOT NULL DEFAULT '' COMMENT '最近登陆ip地址',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='系统用户表';

/*Data for the table `sys_user` */

insert  into `sys_user`(`id`,`username`,`password`,`nc`,`xb`,`dh`,`dzyx`,`zhyxq`,`mmyxq`,`zt`,`zjdlip`) values (2,'admin','$2a$10$b7FbBNdjQDgQNbBbn.bCLeEntO6WBm3Ail/zOSJvM7nCTSr/ZBosq','',1,'','',NULL,NULL,1,''),(3,'user','$2a$10$b7FbBNdjQDgQNbBbn.bCLeEntO6WBm3Ail/zOSJvM7nCTSr/ZBosq','',1,'','',NULL,NULL,1,'');

/*Table structure for table `sys_user_role` */

DROP TABLE IF EXISTS `sys_user_role`;

CREATE TABLE `sys_user_role` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `userid` int(10) unsigned NOT NULL DEFAULT 0 COMMENT '用户id',
  `roleid` int(10) unsigned NOT NULL DEFAULT 0 COMMENT '角色id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 COMMENT='用户与角色关联表';

/*Data for the table `sys_user_role` */

insert  into `sys_user_role`(`id`,`userid`,`roleid`) values (1,2,2),(3,3,3),(4,2,3);

/*Table structure for table `ym_jtjbqk_bgqksm` */

DROP TABLE IF EXISTS `ym_jtjbqk_bgqksm`;

CREATE TABLE `ym_jtjbqk_bgqksm` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `fid` int(10) unsigned NOT NULL COMMENT '贫困户基本信息表id',
  `nr` varchar(1000) DEFAULT '' COMMENT '内容',
  `lrrq` date DEFAULT NULL COMMENT '录入日期',
  `scbz` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '删除标志',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='贫困户家庭基本情况-变更情况说明';

/*Data for the table `ym_jtjbqk_bgqksm` */

/*Table structure for table `ym_jtjbqk_jtcy` */

DROP TABLE IF EXISTS `ym_jtjbqk_jtcy`;

CREATE TABLE `ym_jtjbqk_jtcy` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `fid` int(10) unsigned NOT NULL COMMENT '贫困户基本信息表id',
  `xm` varchar(20) NOT NULL DEFAULT '' COMMENT '姓名',
  `xb` tinyint(1) NOT NULL DEFAULT 1 COMMENT '性别1男0女',
  `zjhm` varchar(25) NOT NULL DEFAULT '' COMMENT '证件号码',
  `yhzgx` tinyint(3) unsigned NOT NULL DEFAULT 0 COMMENT '与户主关系',
  `mz` tinyint(3) unsigned NOT NULL DEFAULT 0 COMMENT '民族',
  `zzmm` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '政治面貌',
  `whcd` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '文化程度',
  `zxszk` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '在校生状况',
  `sxyy` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '失学原因',
  `jkzk` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '健康状况',
  `ldjn` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '劳动技能',
  `sfhjpth` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否会讲普通话',
  `sfcjcxjmjbytlbx` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否参加城乡居民基本医疗保险',
  `sfcjsybcylbx` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否参加商业补充医疗保险',
  `sfxsncjmzjshbz` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否享受农村居民最低生活保障',
  `sfcjcxjmybyanglbx` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否参加城乡居民基本养老保险',
  `sfxsrsywbxbt` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否享受人身意外保险补贴',
  `lxdh` varchar(15) NOT NULL DEFAULT '' COMMENT '联系电话',
  `bz` varchar(600) NOT NULL DEFAULT '' COMMENT '备注',
  `scbz` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '删除标志',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=148 DEFAULT CHARSET=utf8 COMMENT='贫困户家庭基本情况-家庭成员表';

/*Data for the table `ym_jtjbqk_jtcy` */

/*Table structure for table `ym_jtjbqk_jtjbxx` */

DROP TABLE IF EXISTS `ym_jtjbqk_jtjbxx`;

CREATE TABLE `ym_jtjbqk_jtjbxx` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `shi` int(10) unsigned NOT NULL COMMENT '市',
  `xian` int(10) unsigned NOT NULL COMMENT '县（市、区）',
  `zhen` int(10) unsigned NOT NULL COMMENT '镇（乡、街道）',
  `xzc` varchar(20) NOT NULL DEFAULT '' COMMENT '行政村',
  `zrct` varchar(20) NOT NULL DEFAULT '' COMMENT '自然村（屯）',
  `lxdh` varchar(20) NOT NULL DEFAULT '' COMMENT '联系电话',
  `khyh` int(10) unsigned NOT NULL COMMENT '开户银行',
  `yhkh` varchar(20) NOT NULL DEFAULT '' COMMENT '银行卡号',
  `pkhsx` smallint(3) unsigned NOT NULL DEFAULT 0 COMMENT '贫困户属性',
  `jhtpnd` smallint(5) unsigned NOT NULL DEFAULT 0 COMMENT '计划脱贫年度',
  `fpnd` smallint(5) unsigned NOT NULL DEFAULT 0 COMMENT '返贫年度',
  `fpyy` varchar(20) NOT NULL DEFAULT '' COMMENT '返贫原因',
  `sfjls` smallint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否军烈属,1是0否',
  `sfbqh` smallint(1) unsigned NOT NULL DEFAULT 1 COMMENT '是否搬迁户,1是0否',
  `bqfs` varchar(20) NOT NULL DEFAULT '' COMMENT '搬迁方式',
  `bqdz` varchar(80) NOT NULL DEFAULT '' COMMENT '搬迁地址',
  `lrrq` datetime DEFAULT NULL COMMENT '录入日期',
  `xgrq` datetime DEFAULT NULL COMMENT '修改日期',
  `lrrdm` int(10) unsigned NOT NULL DEFAULT 0 COMMENT '录入人代码,id',
  `zpzy1` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '致贫主因1',
  `zpzy2` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '致贫主因1',
  `zpzy3` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '致贫主因1',
  `ncjtrks` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '年初家庭人口数',
  `nmjtrks` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '年末家庭人口数',
  `scbz` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '删除标志',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='贫困户家庭基本情况-基本信息';

/*Data for the table `ym_jtjbqk_jtjbxx` */

insert  into `ym_jtjbqk_jtjbxx`(`id`,`shi`,`xian`,`zhen`,`xzc`,`zrct`,`lxdh`,`khyh`,`yhkh`,`pkhsx`,`jhtpnd`,`fpnd`,`fpyy`,`sfjls`,`sfbqh`,`bqfs`,`bqdz`,`lrrq`,`xgrq`,`lrrdm`,`zpzy1`,`zpzy2`,`zpzy3`,`ncjtrks`,`nmjtrks`,`scbz`) values (1,0,0,0,'','','',0,'',0,0,0,'',0,1,'','',NULL,NULL,0,0,0,0,0,0,0);

/*Table structure for table `ym_jtjbqk_scshtj` */

DROP TABLE IF EXISTS `ym_jtjbqk_scshtj`;

CREATE TABLE `ym_jtjbqk_scshtj` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `fid` int(10) unsigned NOT NULL DEFAULT 0 COMMENT '贫困户基本信息表id',
  `gdmj` decimal(6,2) unsigned NOT NULL DEFAULT 0.00 COMMENT '耕地面积（亩）',
  `ldmj` decimal(6,2) unsigned NOT NULL DEFAULT 0.00 COMMENT '林地面积（亩）',
  `tghlmj` decimal(6,2) unsigned NOT NULL DEFAULT 0.00 COMMENT '退耕还林面积（亩）',
  `lgmj` decimal(6,2) unsigned NOT NULL DEFAULT 0.00 COMMENT '林果面积（亩）',
  `mcdmj` decimal(6,2) unsigned NOT NULL DEFAULT 0.00 COMMENT '牧草地面积（亩)',
  `smmj` decimal(6,2) unsigned NOT NULL DEFAULT 0.00 COMMENT '水面面积（亩）',
  `sfjrnmzyhzs` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否加入农民专业合作社',
  `sfyltqybz` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否有龙头企业带动',
  `sfycyzfdtrdd` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否有创业致富带头人带动',
  `sftshyd` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否通生活用电',
  `sftgbds` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否通广播电视',
  `sfjjaqyys` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否解决安全饮用水',
  `sfywscs` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否有卫生厕所',
  `yczgljl` decimal(5,2) unsigned NOT NULL DEFAULT 0.00 COMMENT '与村主干路距离（公里）',
  `rhllx` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '入户路类型',
  `zfmj` decimal(5,2) unsigned NOT NULL DEFAULT 0.00 COMMENT '住房面积（平方米）',
  `sfwf` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '是否危房',
  `wfdj` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '危房等级',
  `wgnd` smallint(6) unsigned NOT NULL DEFAULT 0 COMMENT '危改年度',
  `zyrllx` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '主要燃料类型',
  `jtrlmc` varchar(20) NOT NULL DEFAULT '' COMMENT '具体燃料名称',
  `lrrq` date DEFAULT NULL COMMENT '录入日期',
  `gxrq` date DEFAULT NULL COMMENT '更新日期',
  `scbz` tinyint(1) unsigned NOT NULL DEFAULT 0 COMMENT '删除标志',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='贫困户家庭基本情况-生产生活条件';

/*Data for the table `ym_jtjbqk_scshtj` */

insert  into `ym_jtjbqk_scshtj`(`id`,`fid`,`gdmj`,`ldmj`,`tghlmj`,`lgmj`,`mcdmj`,`smmj`,`sfjrnmzyhzs`,`sfyltqybz`,`sfycyzfdtrdd`,`sftshyd`,`sftgbds`,`sfjjaqyys`,`sfywscs`,`yczgljl`,`rhllx`,`zfmj`,`sfwf`,`wfdj`,`wgnd`,`zyrllx`,`jtrlmc`,`lrrq`,`gxrq`,`scbz`) values (1,0,'0.00','0.00','0.00','0.00','0.00','0.00',0,0,0,0,0,0,0,'0.00',0,'0.00',0,0,0,0,'',NULL,NULL,1);

/*Table structure for table `ym_jtjbqk_zpyy` */

DROP TABLE IF EXISTS `ym_jtjbqk_zpyy`;

CREATE TABLE `ym_jtjbqk_zpyy` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `fid` int(10) unsigned NOT NULL,
  `zpyy1` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '致贫原因1',
  `zpyy2` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '致贫原因2',
  `zpyy3` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '致贫原因3',
  `ncjtrks` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '年初家庭人口数',
  `nmjtrks` tinyint(2) unsigned NOT NULL DEFAULT 0 COMMENT '年末家庭人口数',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8;

/*Data for the table `ym_jtjbqk_zpyy` */

/*Table structure for table `ym_srdjb_bjrjtwdtpsrxm` */

DROP TABLE IF EXISTS `ym_srdjb_bjrjtwdtpsrxm`;

CREATE TABLE `ym_srdjb_bjrjtwdtpsrxm` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `fid` int(10) unsigned DEFAULT NULL COMMENT '贫困户基本信息表id',
  `lb` tinyint(2) unsigned NOT NULL COMMENT '类别:1教育保障类；2医疗保障类；3,住房保障类；4，产业奖补类；5，金融类；6，社会保障类；7，保险赔付金；8，残疾人补贴；9，捐赠金、慰问金、短期性赡养金、抚养金；10短期性抚恤金；11其他短期性的政策性补助',
  `nf` varchar(10) DEFAULT '' COMMENT '年份',
  `yf` varchar(10) DEFAULT '' COMMENT '月份',
  `je` decimal(9,2) unsigned NOT NULL DEFAULT 0.00 COMMENT '金额',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='贫困户收入登记表-不计入家庭稳定脱贫收入项目';

/*Data for the table `ym_srdjb_bjrjtwdtpsrxm` */

/*Table structure for table `ym_srdjb_ccxsr` */

DROP TABLE IF EXISTS `ym_srdjb_ccxsr`;

CREATE TABLE `ym_srdjb_ccxsr` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `fid` int(10) unsigned DEFAULT NULL COMMENT '贫困户基本信息表id',
  `lb` tinyint(2) unsigned NOT NULL COMMENT '类别：1资产受益扶贫分红收入2其他',
  `nf` varchar(10) DEFAULT '' COMMENT '年份',
  `yf` varchar(10) DEFAULT '' COMMENT '月份',
  `xm` varchar(100) NOT NULL DEFAULT '' COMMENT '姓名',
  `je` decimal(9,2) unsigned NOT NULL DEFAULT 0.00 COMMENT '金额',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='贫困户收入登记表-财产性收入\r\n';

/*Data for the table `ym_srdjb_ccxsr` */

/*Table structure for table `ym_srdjb_gzxsr` */

DROP TABLE IF EXISTS `ym_srdjb_gzxsr`;

CREATE TABLE `ym_srdjb_gzxsr` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `fid` int(10) unsigned DEFAULT NULL COMMENT '贫困户基本信息表id',
  `lb` tinyint(2) unsigned NOT NULL COMMENT '类别：1人员2其他',
  `nf` varchar(10) DEFAULT '' COMMENT '年份',
  `yf` varchar(10) DEFAULT '' COMMENT '月份',
  `xm` varchar(100) NOT NULL DEFAULT '' COMMENT '姓名',
  `wggz` varchar(50) NOT NULL DEFAULT '' COMMENT '务工工种',
  `wgssxx` varchar(200) NOT NULL DEFAULT '' COMMENT '务工省、市、县、乡',
  `wgljsj` smallint(5) unsigned NOT NULL DEFAULT 0 COMMENT '务工累计时间（月）',
  `wgqydwmc` varchar(300) NOT NULL DEFAULT '' COMMENT '务工企业（单位）名称',
  `je` decimal(9,2) unsigned NOT NULL DEFAULT 0.00 COMMENT '金额',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='贫困户收入登记表-工资性收入\r\n';

/*Data for the table `ym_srdjb_gzxsr` */

/*Table structure for table `ym_srdjb_scjyxsz` */

DROP TABLE IF EXISTS `ym_srdjb_scjyxsz`;

CREATE TABLE `ym_srdjb_scjyxsz` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `fid` int(10) unsigned DEFAULT NULL COMMENT '贫困户基本信息表id',
  `lb1` tinyint(2) unsigned NOT NULL COMMENT '类别1：1生产经营性收入2生产经营性支出',
  `lb2` tinyint(2) DEFAULT NULL COMMENT '类别2：1种植业2林业3养殖业4其他',
  `nf` varchar(10) DEFAULT '' COMMENT '年份',
  `yf` varchar(10) DEFAULT '' COMMENT '月份',
  `pz` varchar(20) DEFAULT '' COMMENT '品种',
  `sl` varchar(20) DEFAULT '' COMMENT '数量',
  `je` varchar(20) DEFAULT '' COMMENT '金额',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='贫困户收入登记表-生产经营性收支\r\n';

/*Data for the table `ym_srdjb_scjyxsz` */

/*Table structure for table `ym_srdjb_zyxsr` */

DROP TABLE IF EXISTS `ym_srdjb_zyxsr`;

CREATE TABLE `ym_srdjb_zyxsr` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `fid` int(10) unsigned DEFAULT NULL COMMENT '贫困户基本信息表id',
  `lb1` tinyint(2) unsigned NOT NULL COMMENT '类别:1计划生育金；2低保金；3,特困供养金；4，养老保险金；5，生态补偿金（林业补贴）；6，困难残疾人生活补贴和重度残疾人护理补贴；7，农业补贴；8，高龄补贴；9，水库移民补贴；10其他长期性的政策性补贴',
  `lb2` char(1) DEFAULT '' COMMENT '类别2：A、B、C类',
  `nf` varchar(10) DEFAULT '' COMMENT '年份',
  `yf` varchar(10) DEFAULT '' COMMENT '月份',
  `je` varchar(20) DEFAULT '' COMMENT '金额',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='贫困户收入登记表-生产经营性收支\r\n';

/*Data for the table `ym_srdjb_zyxsr` */

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
